<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,626,1622" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_11490_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="2" name="Constant_11490" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="3" name="Constant_15117_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="2" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_15117" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Subtract_15118" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_101883_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="8" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_101883" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Divide_15120" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="preprocessing" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_293" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="10" name="Constant_294" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/Split" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/Split_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_296" type="Const" version="opset1">
			<data element_type="u64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="U64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="U64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Squeeze_output_0">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/transform/Constant_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 1, 1" offset="30" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/transform/Constant" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Constant_output_0">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/transform/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Sub_output_0">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_101896_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3, 1, 1" offset="36" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_101896" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/transform/Div" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Div_output_0">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_320" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/transform/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/transform/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/transform/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/transform/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="42" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Broadcast_343" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/transform/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/transform/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/transform/Cast_5" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="50" size="16" />
			<output>
				<port id="0" precision="I64" names="/transform/Cast_5_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/transform/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Concat_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Convert_366" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Convert_365" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Divide_367" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_103647" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="66" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Add_369" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/transform/Resize" type="Interpolate" version="opset4">
			<data mode="linear_onnx" shape_calculation_mode="sizes" coordinate_transformation_mode="half_pixel" nearest_mode="floor" antialias="false" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" cube_coeff="-0.75" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>626</dim>
					<dim>1622</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/transform/Resize_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>514</dim>
					<dim>1333</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="36" name="Constant_654" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="37" name="/transform/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>514</dim>
					<dim>1333</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/transform/Gather_output_0">
					<dim>3</dim>
					<dim>514</dim>
					<dim>1333</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/transform/Unsqueeze_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Unsqueeze_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/transform/Shape_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>514</dim>
					<dim>1333</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Shape_1_output_0,/transform/Shape_2_output_0,/transform/Shape_3_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_80719" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="42" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_662" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/transform/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Concat_4_output_0,/transform/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/transform/Cast_10" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Cast_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_687" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/transform/ReduceMax_3" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/ReduceMax_3_output_0" />
			</output>
		</layer>
		<layer id="46" name="/transform/Cast_11" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Cast_11_output_0" />
			</output>
		</layer>
		<layer id="47" name="/transform/Cast_14" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Cast_14_output_0" />
			</output>
		</layer>
		<layer id="48" name="Constant_101909" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="70" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="49" name="/transform/Div_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Div_2_output_0" />
			</output>
		</layer>
		<layer id="50" name="/transform/Ceil_1" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Ceil_1_output_0" />
			</output>
		</layer>
		<layer id="51" name="/transform/Constant_20" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="74" size="4" />
			<output>
				<port id="0" precision="FP32" names="/transform/Constant_20_output_0" />
			</output>
		</layer>
		<layer id="52" name="/transform/Mul_5" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Mul_5_output_0" />
			</output>
		</layer>
		<layer id="53" name="/transform/Cast_15" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Cast_15_output_0" />
			</output>
		</layer>
		<layer id="54" name="/transform/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="42" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_14_output_0" />
			</output>
		</layer>
		<layer id="55" name="/transform/Gather_20" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Gather_2_output_0" />
			</output>
		</layer>
		<layer id="56" name="/transform/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="57" name="Constant_722" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/transform/Unsqueeze_13" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Unsqueeze_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/transform/Unsqueeze_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Unsqueeze_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_80728" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="22" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_658" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="62" name="/transform/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Concat_3_output_0,/transform/Unsqueeze_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/transform/Cast_8" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Cast_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_680" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/transform/ReduceMax_2" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/ReduceMax_2_output_0" />
			</output>
		</layer>
		<layer id="66" name="/transform/Cast_9" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Cast_9_output_0" />
			</output>
		</layer>
		<layer id="67" name="/transform/Cast_12" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Cast_12_output_0" />
			</output>
		</layer>
		<layer id="68" name="Constant_101922" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="70" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="69" name="/transform/Div_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Div_1_output_0" />
			</output>
		</layer>
		<layer id="70" name="/transform/Ceil" type="Ceiling" version="opset1">
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Ceil_output_0" />
			</output>
		</layer>
		<layer id="71" name="/transform/Constant_18" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="74" size="4" />
			<output>
				<port id="0" precision="FP32" names="/transform/Constant_18_output_0" />
			</output>
		</layer>
		<layer id="72" name="/transform/Mul_4" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Mul_4_output_0" />
			</output>
		</layer>
		<layer id="73" name="/transform/Cast_13" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Cast_13_output_0" />
			</output>
		</layer>
		<layer id="74" name="/transform/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="22" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_13_output_0" />
			</output>
		</layer>
		<layer id="75" name="/transform/Gather_10" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="76" name="/transform/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="77" name="Constant_726" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/transform/Unsqueeze_15" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Unsqueeze_15_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/transform/Unsqueeze_16" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Unsqueeze_16_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_80737" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_666" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="/transform/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Concat_2_output_0,/transform/Unsqueeze_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/transform/Cast_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/transform/Cast_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_672" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/transform/ReduceMax_1" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/ReduceMax_1_output_0" />
			</output>
		</layer>
		<layer id="86" name="/transform/Cast_7" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="/transform/Cast_7_output_0" />
			</output>
		</layer>
		<layer id="87" name="/transform/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_15_output_0" />
			</output>
		</layer>
		<layer id="88" name="/transform/Gather_30" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/transform/Gather_3_output_0" />
			</output>
		</layer>
		<layer id="89" name="/transform/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="90" name="Constant_730" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/transform/Unsqueeze_17" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Unsqueeze_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/transform/Concat_6" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
				<port id="5" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I64" names="/transform/Cast_16_output_0,/transform/Concat_6_output_0,/transform/Concat_7_output_0">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/transform/Constant_24" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="78" size="16" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_24_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/transform/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Reshape_output_0">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/transform/Constant_26" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="94" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_26_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/transform/Constant_27" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="102" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_27_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/transform/Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="94" size="8" />
			<output>
				<port id="0" precision="I64" names="/transform/Constant_28_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/transform/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/transform/Slice_1_output_0">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_784" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="110" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/transform/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Transpose_output_0">
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_25703" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="94" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/transform/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/transform/Cast_17_output_0,/transform/Reshape_1_output_0">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_796" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="104" name="Split_797" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_795_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="106" name="Constant_795" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="107" name="/transform/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>514</dim>
					<dim>1333</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/transform/Pad_output_0">
					<dim>3</dim>
					<dim>544</dim>
					<dim>1344</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_1199" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="14" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/transform/Unsqueeze_18" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>544</dim>
					<dim>1344</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/transform/Concat_8_output_0,/transform/Unsqueeze_18_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>1344</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Multiply_102012_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 3, 7, 7" offset="126" size="18816" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Multiply_102012" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/backbone/body/bn1/Mul_2" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>544</dim>
					<dim>1344</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/bn1/Mul_2_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/backbone/body/bn1/Sub_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="18942" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/backbone/body/bn1/Sub" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/bn1/Sub_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/backbone/body/bn1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/bn1/Add_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="/backbone/body/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/relu/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/backbone/body/maxpool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>272</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/maxpool/MaxPool_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Multiply_102021_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 1, 1" offset="19070" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Multiply_102021" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/backbone/body/layer1/layer1.0/bn1/Mul_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/layer1/layer1.0/bn1/Mul_2_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/backbone/body/layer1/layer1.0/bn1/Sub_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="27262" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/backbone/body/layer1/layer1.0/bn1/Sub" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/layer1/layer1.0/bn1/Sub_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="/backbone/body/layer1/layer1.0/bn1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/layer1/layer1.0/bn1/Add_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="/backbone/body/layer1/layer1.0/relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/layer1/layer1.0/relu/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Multiply_102030_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64, 3, 3" offset="27390" size="73728" />
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Multiply_102030" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="/backbone/body/layer1/layer1.0/bn2/Mul_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/layer1/layer1.0/bn2/Mul_2_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/backbone/body/layer1/layer1.0/bn2/Sub_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="101118" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/backbone/body/layer1/layer1.0/bn2/Sub" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/layer1/layer1.0/bn2/Sub_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="/backbone/body/layer1/layer1.0/bn2/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/layer1/layer1.0/bn2/Add_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/backbone/body/layer1/layer1.0/relu_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/body/layer1/layer1.0/relu_1/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="Multiply_102039_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 64, 1, 1" offset="101246" size="32768" />
			<output>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Multiply_102039" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="/backbone/body/layer1/layer1.0/bn3/Mul_2" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/body/layer1/layer1.0/bn3/Mul_2_output_0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>136</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="/backbone/body/layer1/layer1.0/bn3/Sub_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 1, 1" offset="134014" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="/backbone/body/layer1/layer1.0/bn3/Sub" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
